#not the whole list, just things I particularly think are useful to remember to get
alacritty
base
base-devel
brightnessctl
btrfs-progs
#calibre
cmake
dunst
efibootmgr
emacs-wayland
#firefox
git
grim
#grub
htop
hyprland
hyprlock
hyprpaper
#intel-ucode / amd-ucode - only if not already on your EFI partition
#kde-applications
libreoffice-fresh
linux
linux-firmware
#lxinput - for openbox
#lxappearance - for openbox
#lynx
man-db
man-pages
mplayer
nano
networkmanager
#nitrogen - for openbox
#obconf - for openbox
#openbox
openssh
#ntfs-3g
otf-font-awesome
#paru
#picom - for openbox
pipewire-audio
pipewire-jack
pipewire-pulse
plasma
#python-pycryptodome
qt5-wayland
qt6-wayland
#rofi - for openbox
rofi-wayland
#sddm
slurp
sudo
texinfo
thunar
#tint2 - for openbox
#tlp
#tmux
ttf-font-awesome
ttf-liberation
ttf-dejavu
vulkan-intel / vulkan-radeon
waybar
wev
wget
which
#wireless_tools
wireplumber
xdg-desktop-portal-hyprland
#xf86-input-libinput
#xf86-video-fbdev
#xf86-video-intel / xf86-video-amdgpu
#xf86-video-vesa
#xorg-server
#xorg-xbacklight
#bonny sddm
#kde plasma dark 352
localectl set-x11-keymap gb pc105 dvorak ctrl:swapcaps
