#not the whole list, just things I particularly think are useful to remember to get
alacritty
base
base-devel
#calibre
cmake
efibootmgr
emacs
#firefox
git
#grub
htop
#intel-ucode / amd-ucode - only if not already on your EFI partition
kde-applications
linux
linux-firmware
#lxinput - for openbox
#lxappearance - for openbox
lynx
#mplayer
#nano
networkmanager
#nitrogen - for openbox
#obconf - for openbox
#openbox
openssh
ntfs-3g
#paru
#picom - for openbox
plasma
#python-pycryptodome
#rofi - for openbox
sddm
sudo
#tint2 - for openbox
#tlp
tmux
ttf-liberation
ttf-dejavu
vulkan-intel / vulkan-radeon
wget
which
#wireless_tools
xf86-input-libinput
#xf86-video-fbdev
xf86-video-intel / xf86-video-amdgpu
#xf86-video-vesa
xorg-server
xorg-xbacklight
#bonny sddm
#kde plasma dark 352
localectl set-x11-keymap gb pc105 dvorak ctrl:swapcaps
